// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

Console.Write("input five-digit number");
int num = int.Parse(Console.ReadLine());
 int num1 = {num/100000: f1};
 Consol.WriteLine(num1);
